"""
Система рекомендаций

statistic.py - статистические алгоритмы анализа данных (по Сегарану)
* Ранжирование критиков и выявление авторитетных (наиболлее похожих);
* Выявление персональных рекомендаций, согласно оцнке критиков;
* Определение похожих образцов;

neuron.py - алгоритмы нейронных сетей
* Формирование кластеров состоящих из образцов, на основе статистических данных;
* Выявление пределов в которых существуют образцы в кластерах;
* Постновка задач к кластерам аналогичных образцам и персональным рекомендациям;
"""


__author__ = 'rey'

